Revit 2027 API
BuiltInFailures.GeneralFailures.InvalidInputWarn Property
 Invalid Input
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidInputWarn { get; }
Public Shared ReadOnly Property InvalidInputWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidInputWarn {
	FailureDefinitionId^ get ();
}
static member InvalidInputWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace